# Rebar Crank Type Utils Set Crank Length Multiplier Method

Source: https://www.revitapidocs.com/2026/e6286c25-dfb1-282c-5fb0-a8c9e6f36f2e.htm

---

| Rebar Crank Type Utils Set Crank Length Multiplier Method |
| --- |

Sets the crank length multiplier value.
**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static void SetCrankLengthMultiplier(
	Document document,
	ElementId rebarCrankTypeId,
	double crankLengthMultiplier
)
```

```
Public Shared Sub SetCrankLengthMultiplier (
	document As Document,
	rebarCrankTypeId As ElementId,
	crankLengthMultiplier As Double
)
```

```
public:
static void SetCrankLengthMultiplier(
	Document^ document,
	ElementId^ rebarCrankTypeId,
	double crankLengthMultiplier
)
```

```
static member SetCrankLengthMultiplier :
        document : Document *
        rebarCrankTypeId : ElementId *
        crankLengthMultiplier : float -> unit
```

#### Parameters

document Document
:   The document.

rebarCrankTypeId ElementId
:   The Rebar Crank Type id.

crankLengthMultiplier Double
:   The crank length multiplier value.

Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentException | The rebarCrankTypeId doesn't represent a valid Rebar Crank Type. It should be an ElementType of BuiltInCategory.OST\_RebarCrankType category. |
| ArgumentNullException | A non\-optional argument was null |
| ArgumentOutOfRangeException | The given value for crankLengthMultiplier must be positive. |

See Also

#### Reference

RebarCrankTypeUtils Class Autodesk.Revit.DB.Structure Namespace